In [44]:
import pandas as pd

In [50]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                       'author_name':['Тургеньев', 'Чехов', 'Островский']},
                      columns = ['author_id', 'author_name'])

In [51]:
authors

   author_id author_name
0          1   Тургеньев
1          2       Чехов
2          3  Островский

In [52]:
book = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3],
                    'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий',
                                  'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                    'price':[450, 300, 350,500, 450, 370, 290]},
                   columns = ['author_id', 'book_title', 'price'])

In [53]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [54]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'outer')

In [55]:
authors_price

   author_id author_name            book_title  price
0          1   Тургеньев           Отцы и дети    450
1          1   Тургеньев                 Рудин    300
2          1   Тургеньев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [57]:
top5 = authors_price.nlargest(5, 'price')

In [58]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1   Тургеньев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1   Тургеньев  Дворянское гнездо    350

In [66]:
authors_stat = authors_price['author_name'].value_counts()

In [67]:
authors_stat

Тургеньев     3
Островский    2
Чехов         2
Name: author_name, dtype: int64

In [68]:
authors_stat = authors_price.groupby('author_name').agg({'price':['min','max', 'mean']})
authors_stat = authors_stat.rename(columns = {'min':'min_price', 'max':'max_price', 'mean':'mean_price'})

In [69]:
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургеньев         300       450  366.666667
Чехов             450       500  475.000000

In [70]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [81]:
authors_price

   author_id author_name            book_title  price    cover
0          1   Тургеньев           Отцы и дети    450  твердая
1          1   Тургеньев                 Рудин    300   мягкая
2          1   Тургеньев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [83]:
book_info = pd.pivot_table(authors_price, values = 'price', index = ['author_name'],
                          columns = ['cover'])
book_info['мягкая'] = book_info['мягкая'].fillna(0)
book_info['твердая'] = book_info['твердая'].fillna(0)

In [84]:
book_info.to_pickle('book_info.pk1')

In [86]:
book_info2 = pd.read_pickle('book_info.pk1')

In [87]:
book_info.equals(book_info2)

True